flat_fine/Allrun
blockMesh
icoFoam
touch flat.foam
