flat_fine/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    movingWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       3120;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       3160;
    }
    leftWall
    {
        type            patch;
        nFaces          40;
        startFace       3200;
    }
    rightWall
    {
        type            patch;
        nFaces          40;
        startFace       3240;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3200;
        startFace       3280;
    }
)

// ************************************************************************* //
